# -*- coding: utf-8 -*-
import itchat
import re
import os
from itchat.content import *
import linecache
import random


zhiniaoku_pingpai = {'凯儿得乐':0,'米菲':1,'小萌希奥':2,'米兜熊':3,'趣多多':4,'BEABA':5,'dodie多迪':6,'羽小贝':7,'妞仔酷':8,'萌小萌':9,'亲格':10,'鹿飞':11,'柔小希':12,'贝乐茵':13,'爸爸的选择':14,'小茗同学':15,'皮皮克':16,'皇家呵护':17,'乔托':18,'魔法豆豆':19,'优树':20,'巴巴象':21,'婴米乐':22,'小猴子':23,'百诺恩':24,'樱纳芙':25,'实体版史努比':26,'田字格':27,'beaba':28,'光年之外':29,'育萌':30,'唐人街':31,'韩朵':32,'榄菊':33,'嘟嘟侠':34,'妙可舒格':35,'小熊贝斯':36,'妈妈咪呀':37,'柔丫':38,'卡比乐':39,'泰迪熊':40,'吉氏':41,'大王':42,'尤妮佳':43,'花王':44,'爱乐爱':45,'露安适':46,'好奇':47,'帮宝适':48}

zhiniaoku_leibie = {0:[['丝柔纸尿裤','S60.M50.L46.XL42','108','剪码两包包邮'],['丝柔拉拉裤','L30.XL28.XXL26','78','剪码两包包邮'],['丝薄纸尿裤','S60.M50.L46.XL42','118','剪码两包包邮'],['丝薄拉拉裤','L30.XL28.XXL26','88','剪码两包包邮']],1:[['米菲纸尿裤','NB36','128两包','剪码两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 ➕14运费（不剪码84一包，两包包邮）'],['纸尿裤', 'S68.M58.L50.XL46', '128', '剪码两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 ➕14运费（不剪码84一包，两包包邮）'],['拉拉裤', 'L50.XL46.XXL42', '128', '剪码两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 ➕14运费（不剪码84一包，两包包邮）'],['夜用拉拉裤', 'L48.XL44.XXL40', '128', '剪码两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 ➕14运费（不剪码84一包，两包包邮）'],['微生态拉拉裤', 'L46 XL42 XXL38 XXXL36', '128', '剪码两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 ➕14运费（不剪码84一包，两包包邮）']],2:[['NB', 'NB36', '74', '刮码不破包两包包邮NB四包包邮广西 宁夏 甘肃 ➕5运费海南 北京➕2运费新疆 同码三包包邮西藏不发'],['新版纸尿裤', 'S62.M52.L46.XL42', '126', '刮码不破包两包包邮NB四包包邮广西 宁夏 甘肃 ➕5运费海南 北京➕2运费新疆 同码三包包邮西藏不发'],['软萌天使纸尿裤', 'S40 M36 L32 XL28', '***-三包包邮', '刮码不破包两包包邮NB四包包邮广西 宁夏 甘肃 ➕5运费海南 北京➕2运费新疆 同码三包包邮西藏不发'],['软萌天使拉拉裤', 'L30 XL28 XXL26 XXXL24', '***-三包包邮', '刮码不破包两包包邮NB四包包邮广西 宁夏 甘肃 ➕5运费海南 北京➕2运费新疆 同码三包包邮西藏不发'],['拉拉裤', 'L52.XL48.XXL44', '146', '刮码不破包两包包邮NB四包包邮广西 宁夏 甘肃 ➕5运费海南 北京➕2运费新疆 同码三包包邮西藏不发']],3:[['经典纸尿裤1', 'NB30', '***-四包包邮', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['经典纸尿裤2', 'S66.M54.L50.XL46.XXL42', '89', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['经典拉拉裤', 'L48.XL44.XXL44.XXXL40', '89', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['经典纸尿片', 'S68 M58 L54 XL50', '***', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['至尊纸尿裤1', 'NB28', '***-四包包邮', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['至尊纸尿裤2', 'S62.M52.L48.XL44，XXL40', '98', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['至尊拉拉裤', 'M46.L44.XL42.XXL40.XXXL38', '98', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发'],['至尊一体裤', 'L42 XL40 XXL38', '***', '两包包邮经典不剪码至尊剪码（至尊不剪码112两包包邮）甘肃 宁夏 海南➕3运费新疆 西藏 青海 不发']],4:[['趣多多纸尿裤','S62.M52.L48.XL44.XXL42','95','剪码两包包邮不减码115两包偏远地区运费➕2新疆青海西臧不发'],['趣多多拉拉裤','L48.XL44.XXL44.XXXL42','95','剪码两包包邮不减码115两包偏远地区运费➕2新疆青海西臧不发'],['趣多多一体裤','L42.XL40.XXL40','99','剪码两包包邮不减码115两包偏远地区运费➕2新疆青海西臧不发']],5:[['盛夏纸尿裤','S38 M36 L34 XL32','129',' '],['盛夏拉拉裤','L34 XL32 XXL30','139',' '],['蝉翼纸尿裤','S60 M54 L48 XL44','159',' '],['糖果拉拉裤','L40 XL38 XXL36','159',' '],['大鱼海棠纸尿裤','NB60S58M50L42XL36','189',''],['大鱼海棠拉拉裤','L36XL34XXL32','189',' '],['炫彩纸尿裤','S60 M52 L44 XL38','195',' '],['炫彩拉拉裤','L40 XL38 XXL35','159',' '],['丛林物语纸尿裤','S62 M52 L44 XL40','178',' '],['丛林物语拉拉裤','L38 XL36 XXL34','178',' '],['冰淇淋纸尿裤','S62 M52 L46 XL42','195',' '],['冰淇淋拉拉裤','L40 XL38 XXL36','159',' '],['plus纸尿裤','S72M64L54 XL44','89',' '],['plus拉拉裤','L22 XL20XXL18','89',' ']],6:[['电商版','***','***',' ']],7:[['羽小贝纸尿裤','S64.M52.L48.XL44.XXL42','82','两包包邮不剪码'],['羽小贝拉拉裤','L46.XL44.XXL44.XXXL42','82','两包包邮不剪码'],['鹿飞纸尿裤','S50 M46 L40 XL36 XXL34','75','两包包邮不剪码'],['鹿飞拉拉裤','L40 XL38 XXL36 XXXL34','75','两包包邮不剪码']],8:[['纸尿裤','S66.M56.L50.XL44','90','两包包邮剪码'],['拉拉裤','L48.XL46.XXL44.XXXL40','90','两包包邮剪码']],9:[['萌小萌纸尿裤','S56.M50.L46.XL42.XXL40','85','两包包邮不剪码北京广西宁夏甘肃青海内蒙➕5运费海南新疆西藏不发'],['萌小萌拉拉裤','M46.L44.XL42.XXL40','85','两包包邮不剪码北京广西宁夏甘肃青海内蒙➕5运费海南新疆西藏不发'],['萌小萌一体裤','M42.L42.XL40.XXL38','85','两包包邮不剪码北京广西宁夏甘肃青海内蒙➕5运费海南新疆西藏不发']],10:[['经典纸尿裤','S54 M50 L46 XL42','88','两包包邮剪码经典不剪码'],['经典拉拉裤','全部50','98','两包包邮剪码经典不剪码'],['轻薄纸尿裤','S58 M48 L44 XL40 XXL38','78','两包包邮剪码经典不剪码'],['轻薄拉拉裤','M48 L44 XL42 XXL40 XXXL38','78','两包包邮剪码经典不剪码'],['贵族纸尿裤','S52 M44 L42 XL40 XXL38','83','两包包邮剪码经典不剪码'],['贵族拉拉裤','M48 L44 XL42 XXL40 XXXL38','83','两包包邮剪码经典不剪码']],11:[['纸尿裤拉拉裤','***','***',' ']],12:[['纸尿裤','S56.M48.L44.XL42.XXL40','88','不剪码两包包邮青海西藏新疆不发'],['拉拉裤','M42.L40.XL40.XXL38','88','不剪码两包包邮青海西藏新疆不发']],13:[['纸尿裤','S62.M52.L48.XL44，XXL40','98','同码双数接单'],['拉拉裤','M44 L42 XL40 XXL38 XXXL38','98','同码双数接单']],14:[['纸尿裤1','NB90','109','刮码不破包两包包邮 北京➕2青海 内蒙 宁夏➕5运费新疆 西藏 ➕10运费'],['纸尿裤2','S72.M56.L48.XL44','109','刮码不破包两包包邮 北京➕2青海 内蒙 宁夏➕5运费新疆 西藏 ➕10运费'],['拉拉裤','L44.XL42.XXL40','109','刮码不破包两包包邮 北京➕2青海 内蒙 宁夏➕5运费新疆 西藏 ➕10运费']],15:[['纸尿裤','S56 M46 L42 XL38','99','剪码两包包邮'],['拉拉裤','L28 XL26 XXL24 XXXL22','69','剪码两包包邮']],16:[['皮皮克纸尿裤','S62.M54.L50.XL46','75','两包包邮不剪码'],['皮皮克拉拉裤','L42.XL40.XXL38','75','两包包邮不剪码']],17:[['至尊版纸尿裤','S54.M50.L46.XL42.XXL40','88','两包包邮刮码不破包'],['至尊版拉拉裤','M48.L46.XL44.XXL42.XXXL40','88','两包包邮刮码不破包'],['贵族版纸尿裤','NB64.S60.M56.L52.XL48.XXL44','95','两包包邮刮码不破包'],['贵族版拉拉裤','M54.L50.XL46.XXL42','95','两包包邮刮码不破包'],['一体裤','L34 XL32 XXL30','***','两包包邮刮码不破包']],18:[['乔托王子纸尿裤','S52.M46.L42.XL40','89','两包包邮不剪码'],['乔托王子拉拉裤','L42.XL40.XXL38','89','两包包邮不剪码'],['乔托纸尿裤','S52.M46.L42.XL40','89','两包包邮不剪码'],['乔托拉拉裤','L42.XL40.XXL38','89','两包包邮不剪码']],19:[['魔法豆豆纸尿裤','S60.M52.L46.XL42','82','两包包邮不剪码'],['魔法豆豆拉拉裤','M48.L46.XL44.XXL42.XXXL40','82','两包包邮不剪码']],20:[['优树铂金装纸尿裤','S56.M50.L46.XL42','109','两包包邮不剪码'],['优树铂金装拉拉裤','L50.XL46.XXL44','119','两包包邮不剪码']],21:[['巴巴象纸尿裤','S60.M50.L46.XL42.XXL40','86','两包包邮剪码'],['巴巴象拉拉裤','L42.XL40.XXL40','86','两包包邮剪码']],22:[['婴米乐纸尿裤','S62.M54.L48.XL44','99','两包包邮不剪码'],['婴米乐拉拉裤','L46.XL44.XXL42','99','两包包邮不剪码']],23:[['小猴子沙漏纸尿裤','S62.M50.L46.XL42','118','两包包邮'],['小猴子沙漏一体裤','M48.L46.XL44.XXL42','118','两包包邮']],24:[['云薄纸尿裤','NB68.S58.M50.L40.XL36','128','两包包邮不备注哪个系列的默认阳光剪码，不减码85一包'],['云薄拉拉裤','L36.XL32.XXL28','128','两包包邮不备注哪个系列的默认阳光剪码，不减码85一包'],['阳光纸尿裤','NB68.S58.M50.L40.XL36','128','两包包邮不备注哪个系列的默认阳光剪码，不减码85一包'],['阳光拉拉裤','L36.XL32.XXL28','128','两包包邮不备注哪个系列的默认阳光剪码，不减码85一包']],25:[['樱纳芙纸尿裤（纤柔）','S60.M52.L48.XL44','108','两包包邮不剪码'],['樱纳芙拉拉裤（纤柔）','L44.XL42.XXL40','108','两包包邮不剪码'],['樱纳芙纸尿裤（薄款）','S40.M36.L32.XL30','68','两包包邮不剪码'],['樱纳芙拉拉裤（薄款）','L30.XL28.XXL26','68','两包包邮不剪码']],26:[['史努比纸尿裤','***','***','两包包邮']],27:[['纸尿裤','***','***','两包包邮']],28:[['游泳裤','20个','***','一包包邮不剪码日本原装进口'],['经期裤','10/20包','***','一包包邮不剪码日本原装进口'],['纸巾1','40抽100包','***','一包包邮不剪码日本原装进口'],['纸巾2','120抽12包','***','一包包邮不剪码日本原装进口']],29:[['光年之外纸尿裤','S62M52L44XL40','178',' '],['光年之外拉拉裤','L38XL36XXL34','178',' ']],30:[['纸尿裤','***','52',' '],['拉拉裤','***','58',' ']],31:[['纸尿裤','S54.M50.L46.XL42','70','两包包邮'],['拉拉裤','L42.XL40.XXL40.XXXL40','70','两包包邮']],32:[['韩朵纸尿裤','S56.M50.L44.XL40.XXL36','88','两包包邮'],['韩朵拉拉裤','M50.L50.XL50.XXL50','88','两包包邮'],['韩朵一体裤','L48.XL46.XXL44','***','两包包邮']],33:[['榄菊纸尿裤','S80.M70.L62.XL54','108','两包包邮不剪码'],['榄菊拉拉裤','L56.XL52.XXL50','108','两包包邮不剪码']],34:[['超值纸尿裤','S54 M50 L46 XL42','79','两包包邮不剪码'],['超值拉拉裤','L44 XL42 XXL40','79','两包包邮不剪码'],['精装纸尿裤','S62 M54 L50 XL46','98','两包包邮不剪码'],['精装拉拉裤','L50 XL48 XXL46','98','两包包邮不剪码']],35:[['舒薄纸尿裤','S62 M52 L48 XL44','108','两包包邮'],['舒薄拉拉裤','L42 XL40 XXL38','108','两包包邮'],['舒柔纸尿裤','S60 M50 L46 XL42','68','两包包邮'],['舒柔拉拉裤','L38 XL36 XXL34','68','两包包邮']],36:[['超薄款纸尿裤','NB70 S62 M58 L50 XL42','108','两包包邮广东省剪码'],['铂金款纸尿裤','S54 M48 L44 XL40 XXL40','108','两包包邮广东省剪码'],['乐享款拉拉裤','M48 L44 XL42 XXL40','108','两包包邮广东省剪码'],['沙漏款拉拉裤','M48 L44 XL40 XXL40','108','两包包邮广东省剪码']],37:[['纸尿裤','S60.M54.L50.XL46','126','两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 不发'],['拉拉裤','L34.XL32.XXL30','90','两包包邮青海 内蒙 宁夏➕5运费新疆 西藏 不发']],38:[['纸尿裤','S68 M62 L56 XL50 XXL46','88','两包包邮不剪码'],['拉拉裤','M62 L58 XL54 XXL50 XXXL46','88','两包包邮不剪码']],39:[['小蜜蜂纸尿裤','S56.M50.L46.XL40','88','两包包邮不剪码'],['小蜜蜂拉拉裤','M46.L42.XL40.XXL40','98','两包包邮不剪码']],40:[['亲肤纸尿裤','S82 M70 L70 XL70','***','两包包邮剪码'],['亲肤拉拉裤','L32 XL30 XXL28','***','两包包邮剪码'],['臻薄纸尿裤','S78.M68.L58.XL500','***','两包包邮剪码'],['臻薄拉拉裤','L20.XL18.XXL18','***-四包包邮','两包包邮剪码'],['轻盈透薄纸尿裤','S76 M66 L60 XL54','***','两包包邮剪码'],['超薄拉拉裤','L21 XL18 XXL18','***-四包包邮','两包包邮剪码']],41:[['吉氏6D纸尿裤','S82.M64.L54.XL44','168','两包包邮剪码'],['吉氏6D拉拉裤','L44.XL38','168','两包包邮剪码']],42:[['大王天使纸尿裤','NB46 M46.L38.XL30','***-一包+5运费两包包邮','390一箱四包包邮'],['大王天使拉拉裤','L32.XL28.XXL20','***-一包+5运费两包包邮','390一箱四包包邮']],43:[['纸尿裤','NB114 S105 M80 L68 XL56','***','本土两包包邮'],['拉拉裤','M72 L56 XL38','***','本土两包包邮'],['皇家纸尿裤','NB66 S60 M48 L40','***','本土455一箱四包'],['皇家拉拉裤','L38 XL34','***','本土455一箱四包']],44:[['本土纸尿裤','NB90➕6 S82 M64➕6 L54➕6 XL44','***','两包包邮一包+5运费不剪码日本原装进口'],['妙而舒','S144 M128 L108 XL84(M66)','***','台湾版两包包邮一包+5运费']],45:[['纸尿裤','NB68 S58 M50 L40 XL36','***-两包包邮','335一箱四包可拼码包邮'],['拉拉裤','L36 XL32 XXL28','***-两包包邮','335一箱四包可拼码包邮']],46:[['纸尿裤（日用）','S58.M48.L40.XL36','***-一包+5运费两包包邮','可拼码445一箱不剪码可积分可扫码'],['纸尿裤（夜用）','S56.M46.L38.XL34','***-一包+5运费两包包邮','可拼码445一箱不剪码可积分可扫码'],['拉拉裤','L36.XL32.XXL28','***-一包+5运费两包包邮','可拼码445一箱不剪码可积分可扫码']],47:[['铂金装纸尿裤','NB84 S96 M92 L76 XL64','***','一包包邮偏远地区除外不剪码'],['铂金装拉拉裤','M60 L76 XL64 XXL40','***','一包包邮偏远地区除外不剪码'],['金装纸尿裤','NB80 S70 S84 S120 M162 L129 XL105 XXL28','***','一包包邮偏远地区除外不剪码'],['金装拉拉裤','M56 L40 L124 XL34 XL96 XXL42','***','一包包邮偏远地区除外不剪码'],['银装纸尿裤','NB88 S80 S164 M160 L128 XL104','***','一包包邮偏远地区除外不剪码'],['银装拉拉裤','M25 L24 XL19 XXL80','***','一包包邮偏远地区除外不剪码'],['心钻系列纸尿裤','NB66 S62 M50 L40 XL32','***','一包包邮偏远地区除外不剪码']],48:[['绿帮纸尿裤','NB96 NB140 S114 M192 L164 XL128','***','一包包邮不剪码'],['绿帮拉拉裤','M48 M124 M152 L52 L120 L172 XL108 XL136 XXL86','***','一包包邮不剪码'],['一级帮纸尿裤','NB66 NB84 NB98 S60 S76 S108 M48 M62 M144 L40 L52 XL42 XL96','***','一包包邮不剪码日本原装进口'],['一级帮拉拉裤','M46 M58 M74 M92 L46 L72 XL40 XL64 XXL30 XXL50','***','一包包邮不剪码日本原装进口']]}

title = {'纸尿裤报价表':[zhiniaoku_pingpai,zhiniaoku_leibie],}


def zuhe(abc):
    """
    通过随机生成一个字母，来选择类别前面的图形
    :param abc: 
    :return: 
    """
    a = int(random.randint(0, 6))
    for i in range(len(abc)):
        tux = {0:['✿','❀'],1:['●','○'],2:['◆','◇'],3:['▲','△'],4:['▼','▽'],5:['■','□'],6:['◼️','🔹️']}
        if i % 2 == 0:
            abc[i] = tux[a][0] + ' ' +abc[i]
        else:
            abc[i] = tux[a][1] + ' ' + abc[i]
    return abc


@itchat.msg_register([TEXT])
def text_reply(msg):
    """
    :param msg:
    :return: 
    """
    MSG = msg['Text']
    username = itchat.search_friends(userName=msg['FromUserName'])['NickName']
    print(username+'--'+MSG)

    # 创建文件夹
    if not os.path.exists('./user'):
        os.mkdir('./user')
    usr_path = './user/{}.txt'.format(username)

    # 查看是否存在用户的文件，如果没有就创建。
    if not os.path.exists(usr_path):
        with open(usr_path,'w',encoding='utf-8') as num:
            num.write('')

    # 查看用户文件内部的行数
    with open(usr_path, 'r', encoding='utf-8') as f:
        lines = f.readlines()

    # 使用户进行回选
    if MSG == '选好了':
        title_name = lines[0][:-1][:-3]
        pingpai_name = lines[1][:-1]
        leibie_name = lines[2][:-1]
        guige_name = lines[3][:-1]
        with open('buy.txt', 'a', encoding='utf-8') as f:
            f.write('种类：\n{}\n品牌：\n{}\n类别：\n{}\n规格：\n{}\n姓名：\n{}\n'.format(title_name,pingpai_name,leibie_name,guige_name,username))
        with open(usr_path, 'w', encoding='utf-8') as num:
            num.write('')
        itchat.send('好的，感谢您选择我们的产品，\n祝您身体健康，阖家欢乐。'.format(),msg['FromUserName'])

    if MSG == '重选':
        with open(usr_path,'w',encoding='utf-8') as num:
            num.write('')
        itchat.send('好的，您现在可以继续选则想要的种类拉'.format(),msg['FromUserName'])

    if MSG == '品牌':
        title_name = lines[0][:-1]
        with open(usr_path,'w',encoding='utf-8') as num:
            num.write(title_name+'\n')
        itchat.send('好的，您现在可以继续选喜欢的品牌啦'.format(), msg['FromUserName'])

    if MSG == '类别':
        title_name = lines[0][:-1]
        pingpai_name = lines[1][:-1]
        with open(usr_path, 'w', encoding='utf-8') as num:
            num.write('{}\n{}\n'.format(title_name, pingpai_name))
        itchat.send('好的，您现在可以继续选喜欢的类别啦'.format(), msg['FromUserName'])



    # first
    # msg = '纸尿裤报价表'，根据给的种类发松相应的品牌名称：
    if MSG in title:
        itchat.send('你好！\n如下是-{}-的各个品牌列表：\n{}\n请选择想咨询的品牌。\n如果想重新选择可以输入‘重选’'.format(msg['Text'][:-3], '\n'.join([i for i in zuhe(list(title[MSG][0].keys()))])), msg['FromUserName'])
        with open(usr_path, 'w', encoding='utf-8') as num:
            num.write(MSG+'\n')


    # second
    usr_len = len(open(usr_path, "r", encoding='utf-8').readlines())
    # msg = '凯儿得乐'
    if MSG in list(title[lines[0][:-1]][0].keys()) or usr_len == 1:# 判断这个用户是否经过了询问种类而得到品牌名称
        title_name = lines[0][:-1]
        detail_pingpai = title[title_name][1][title[title_name][0][MSG]]
        liebiao = []
        for m in range(len(detail_pingpai)):
            liebiao.append(detail_pingpai[m][0])
        itchat.send('你好，\n这是-{}-的各种信息.\n类别:\n{}\n请选择想要的类别。\n如果想重新选择品牌可以输入‘品牌’也可以直接输入品牌名字进行重新选择。'.format(MSG, '\n'.join([i for i in zuhe(liebiao)])),msg['FromUserName'])
        with open(usr_path,'w',encoding='utf-8') as num:
            num.write('{}\n{}\n'.format(title_name,MSG))


    #msg = '丝柔纸尿裤'类别
    elif MSG in [''.join(i[0]) for i in title[lines[0][:-1]][1][title[lines[0][:-1]][0][lines[1][:-1]]]] or usr_len == 2:#判断这个用户是否经过了询问品牌名称而得到品牌类别
        pingpai_name  = lines[1][:-1]
        title_name = lines[0][:-1]
        detail_pingpai = title[title_name][1][title[title_name][0][pingpai_name]]
        liebiao = []
        for m in range(len(detail_pingpai)):
            liebiao.append(detail_pingpai[m][0])
        if MSG in liebiao:#可以控制用户在输入别的话时，出现乱发信息。
            ind = liebiao.index(MSG)#查看类别所在detail_pingpai的位置
            detail_imag = detail_pingpai[ind]
            guige = detail_imag[1]#获得规格
            price = detail_imag[2]#获得价格
            beizhu = detail_imag[3]#获得备注
            itchat.send('你好，\n这是-{}-品牌\n-{}-类别的具体参数\n规格：\n{}\n价格:\n{}\n请您再次选择所需要的类型.\n如果想重新选择类别可以输入‘类别’也可以直接输入类别名字进行重新选择'.format(pingpai_name,MSG,guige,price,beizhu),msg['FromUserName'])
            with open(usr_path, 'w', encoding='utf-8') as num:
                num.write('{}\n{}\n{}\n'.format(title_name, pingpai_name,MSG))
        else:
            pass


    if usr_len == 3:
        title_name = lines[0][:-1]  # 获得纸尿裤报价表
        pingpai_name = lines[1][:-1]  # 获得品牌名称凯儿得乐
        leibie_name = lines[2][:-1] #获得类别名称
        detail_pingpai = title[title_name][1][title[title_name][0][pingpai_name]]
        liebiao = []
        for n in range(len(detail_pingpai)):
            liebiao.append(detail_pingpai[n][0])
        ind = liebiao.index(leibie_name)  # 查看类别所在detail_pingpai的位置
        detail_imag = detail_pingpai[ind]
        guige = detail_imag[1]  # 获得规格
        if MSG in guige:#可以控制用户在输入别的话时，出现乱发信息。
            itchat.send('您选择了\n品牌名：{}\n类别名：{}\n规格：{}\n如果您选择好了，可以输入‘选好了’来确定选择，或者也可以输入‘重选’来重新选择。'.format(pingpai_name,leibie_name,MSG),msg['FromUserName'])
            with open(usr_path, 'w', encoding='utf-8') as num:
                num.write('{}\n{}\n{}\n{}\n'.format(title_name, pingpai_name, leibie_name, MSG))


if __name__ == '__main__':
    itchat.auto_login()
    itchat.run()
